"""
실습 9: 택시 요금 계산

이동 거리(m)를 입력받아 택시 요금을 계산하세요.

[요금 규칙]
- 기본요금: 4800원 (최초 1600m 포함)
- 추가요금: 131m마다 100원

힌트: 1600m 이하이면 기본요금만, 초과하면 추가 거리를 계산합니다.
      초과 거리에서 131m당 추가요금은 //(몫)으로 구합니다.
"""

distance = int(input("이동 거리(m)를 입력하세요: "))

# 아래에 택시 요금을 계산하여 출력하세요

# 1600m 이하이면 기본요금만
if distance <= 1600:
      taxi = 4800
# 추가 요금
else:
      over = (distance - 1600) // 131 * 100

# 출력
print(f"이동 거리: {distance}m")
print(f"택시 요금: {over + 4800}원")

"""
[실행 결과 예시] (입력: 3500)
이동 거리: 3500m
택시 요금: 6200원
"""
