"""
글로벌시스템융합과 프로그래밍(1) 실습 문제
실습 44: 출석부

N명의 이름과 출석 여부를 입력받아 출석/결석 인원을 출력합니다.
- 출석 여부는 1(출석) 또는 0(결석)으로 입력

힌트: for + if/else를 조합합니다.
"""

n = int(input("학생 수를 입력하세요: "))
present = 0
absent = 0

# 아래에 출석부 코드를 작성하세요
# 1부터 n+1까지 반복
for i in range(1, n + 1):
    
    # 학생 이름 입력받기
    name = input(str(i) + "번 학생 이름: ")

    # 출석, 결석 입력받기
    status = int(input("출석 여부 (1:출석 / 0:결석): "))

    # 1인 경우 출석
    if status == 1:
        print(name, "- 출석")
        present += 1
    else:  # 아니면 결석
        print(name, "- 결석")
        absent += 1

# 출력
print("--- 출석 결과 ---")
print("출석:", present, "명")
print("결석:", absent, "명")


"""
[실행 결과 예시]
학생 수를 입력하세요: 4
1번 학생 이름: 김민수
출석 여부 (1:출석 / 0:결석): 1
김민수 - 출석
2번 학생 이름: 이영희
출석 여부 (1:출석 / 0:결석): 0
이영희 - 결석
3번 학생 이름: 박철수
출석 여부 (1:출석 / 0:결석): 1
박철수 - 출석
4번 학생 이름: 정수진
출석 여부 (1:출석 / 0:결석): 1
정수진 - 출석
--- 출석 결과 ---
출석: 3 명
결석: 1 명
"""
